#+TITLE: CITU Survey
#+OPTIONS: toc:nil H:2
#+LATEX_CLASS: varticle
#+LATEX_CLASS_OPTIONS: [11pt,twoside,openany,strict,extrafontsizes,article]
#+OPTIONS: toc:nil num:2
#+STARTUP: hideblocks
#+PROPERTY: header-args:R :session citu :eval never-export


#+NAME: readdata
#+BEGIN_SRC R :results silent :exports none
      library(data.table)
      library(openxlsx)
      read.xlsx("citu-survey-cer.xlsx",sheet=2)->citu.cer
      setDT(citu.cer)
      names(citu.cer)
      gsub("/",".",names(citu.cer))->names(citu.cer)
      gsub(",",".",names(citu.cer))->names(citu.cer)
      gsub("\\-",".",names(citu.cer))->names(citu.cer)
      gsub("\\(",".",names(citu.cer))->names(citu.cer)
      gsub("\\)",".",names(citu.cer))->names(citu.cer)
      gsub("\\?","",names(citu.cer))->names(citu.cer)
      gsub("\\,",".",names(citu.cer))->names(citu.cer)
      gsub("\\&",".",names(citu.cer))->names(citu.cer)
      gsub("\\.\\.",".",names(citu.cer))->names(citu.cer)
      gsub("\\.\\.",".",names(citu.cer))->names(citu.cer)
      gsub("\\.\\.",".",names(citu.cer))->names(citu.cer)
      gsub("Whether\\.there\\.is\\.any\\.differential\\.treatment\\.in\\.the\\.enterprise\\.on\\.the\\.basis\\.of\\.the\\.following\\:",
       "Discrimination.",names(citu.cer))->names(citu.cer)
      citu.cer[,.N,Phone.number][order(-N)]
      citu.cer[!is.na(Age)]->citu.cer
      c(1:nrow(citu.cer))->citu.cer$SNo
      citu.cer[,.N,.(Name.Name,Phone.number)][order(-N)]
      citu.cer[Phone.number=="91 99028 49859"]
#+end_src

+ Number of workers by sex

#+NAME: sex
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
citu.cer[,.N,Sex]
#+end_src

#+CAPTION: Number of workers by sex
#+RESULTS: sex
| Sex    |   N |
|--------+-----|
| Male   | 145 |
| Female |   5 |

+ Number of workers in different age groups

#+NAME: age-group
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[Age<=18,Age.group:="1. Up to 18"]
  citu.cer[is.na(Age.group)&Age<=30,Age.group:="2. Up to 30"]
  citu.cer[is.na(Age.group)&Age<=45,Age.group:="3. Up to 45"]
  citu.cer[is.na(Age.group)&Age<=60,Age.group:="4. Up to 60"]
  citu.cer[is.na(Age.group)&Age>60,Age.group:="5. More than 60"]
  citu.cer[is.na(Age.group),Age.group:="6. No information"]
  citu.cer[,.N,Age.group][order(Age.group)]
#+end_src

#+CAPTION: Number of workers in different age groups
#+RESULTS: age-group
| Age.group   |  N |
|-------------+----|
| 1. Up to 18 |  1 |
| 2. Up to 30 | 25 |
| 3. Up to 45 | 94 |
| 4. Up to 60 | 30 |

+ Number of workers in different social groups

#+NAME: social-group
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
citu.cer[,.N,Social.Group]
#+end_src

#+CAPTION: Number of workers in different social groups
#+RESULTS: social-group
| Social.Group |  N |
|--------------+----|
| General      | 52 |
| OBC          | 71 |
| ST           |  4 |
| SC           | 16 |
|              |  7 |


+ Number of workers, by religion

#+NAME: religion
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
citu.cer[,.N,Religion]
#+end_src

#+CAPTION: Number of workers, by religion
#+RESULTS: religion
| Religion  |   N |
|-----------+-----|
| Hindu     | 135 |
| Christian |   3 |
| Lingayath |   1 |
| Muslim    |  10 |
|           |   1 |

+ Number of workers who reported different mother tongues

#+NAME: mother.tongue
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[Mother.tongue=="Kannnada"|Mother.tongue=="kannada"|Mother.tongue=="KANNADA"|Mother.tongue=="ಕನ್ನಡ"|Mother.tongue=="Kasturi ಕನ್ನಡ",Mother.tongue:="Kannada"]
  citu.cer[Mother.tongue=="Thelugu"|Mother.tongue=="TEUGU"|Mother.tongue=="Telgu"|Mother.tongue=="Telugu and Hindi"|Mother.tongue=="Telugu Hindi",Mother.tongue:="Telugu"]
  citu.cer[Mother.tongue=="TAMIL",Mother.tongue:="Tamil"]
  citu.cer[Mother.tongue=="हिंदी"|Mother.tongue=="HINDI"|Mother.tongue=="Hindu"|Mother.tongue=="Hind",Mother.tongue:="Hindi"]
  citu.cer[Mother.tongue=="URDU",Mother.tongue:="Urdu"]
  citu.cer[Mother.tongue=="Citu",Mother.tongue:=NA]
  citu.cer[,.N,Mother.tongue]
#+end_src

#+CAPTION: Number of workers who reported different mother tongues
#+RESULTS: mother.tongue
| Mother.tongue |  N |
|---------------+----|
| Telugu        | 62 |
| Kannada       | 63 |
| Marathi       |  4 |
| Hindi         | 12 |
| Lambadi       |  1 |
| Konkani       |  1 |
| Tamil         |  2 |
| Urdu          |  4 |
| Banjara       |  1 |

+ Number of workers, by level of education

#+NAME: education
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[,.N,Education.Training]
#+end_src

#+CAPTION: Number of workers, by level of education
#+RESULTS: education
| Education.Training   |  N |
|----------------------+----|
| Graduation           | 19 |
| ITI                  | 89 |
| JOC                  |  1 |
| Higher Secondary     | 16 |
| Graduate Engineering |  2 |
| Secondary            | 13 |
| Polytechnic          |  1 |
| Diploma Engineering  |  7 |
| Masters              |  2 |

+ Number of workers, by different types of housing


#+NAME: housing.type
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[,.N,Housing.type]
#+end_src

#+CAPTION: Number of workers, by type of housing
#+RESULTS: housing.type
| Housing.type                   |  N |
|--------------------------------+----|
| Provided rent free by employer |  3 |
| Rented                         | 75 |
| Owned                          | 70 |
|                                |  1 |
| Lease house                    |  1 |


+ Type of work in the factory was not coded. So there are various entries. These should somehow be categorised to make them meaningful.

#+NAME: work
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[grep("Operator",What.is.the.work.you.do.in.the.factory,ignore.case =TRUE),What.is.the.work.you.do.in.the.factory:="Operator"]
  citu.cer[grep("oprat[o,a,e]r",What.is.the.work.you.do.in.the.factory,ignore.case =TRUE),What.is.the.work.you.do.in.the.factory:="Operator"]
  citu.cer[grep("opret[o,a,e]r",What.is.the.work.you.do.in.the.factory,ignore.case =TRUE),What.is.the.work.you.do.in.the.factory:="Operator"]
  citu.cer[grep("oper[e,a]t[e,a,o]r",What.is.the.work.you.do.in.the.factory,ignore.case =TRUE),What.is.the.work.you.do.in.the.factory:="Operator"]
  citu.cer[grep("operating",What.is.the.work.you.do.in.the.factory,ignore.case =TRUE),What.is.the.work.you.do.in.the.factory:="Operator"]
  citu.cer[,.N,What.is.the.work.you.do.in.the.factory]
#+end_src

#+CAPTION: Number of workers, by level of education
#+RESULTS: work
| What.is.the.work.you.do.in.the.factory                 |  N |
|--------------------------------------------------------+----|
| Fitter                                                 | 15 |
| Welder                                                 |  9 |
| Assembly                                               |  2 |
| Quality inspector                                      |  4 |
| Ts                                                     |  1 |
| Operator                                               | 47 |
| Electrication                                          |  1 |
| Trainee                                                |  1 |
| Machine maintenance                                    |  1 |
| Technician                                             |  1 |
| Maintenance Department                                 |  1 |
| Logistics Service                                      |  1 |
| Chargeman                                              |  1 |
| Hr executive                                           |  1 |
| Assembly work                                          |  1 |
| Store                                                  |  1 |
| Assembling                                             |  1 |
| एक्सट्रूजन ऑपरेटर                                          |  1 |
| L V windr                                              |  1 |
| Painter                                                |  4 |
| QA                                                     |  1 |
| Fitter work                                            |  1 |
| Casual                                                 |  1 |
| Winder                                                 |  2 |
| Engineering Electrical & Instrumentation Maintenance . |  1 |
| Brazing                                                |  1 |
| Electrician                                            |  2 |
| Cauvel helpher                                         |  1 |
| Testing  & cca                                         |  1 |
| Apprentance Fitter                                     |  1 |
| Helpher                                                |  1 |
| Canteen                                                |  1 |
| Workar                                                 |  1 |
| Manufacturing                                          |  1 |
| PAINTER                                                |  1 |
| fitter                                                 |  1 |
| Drinks                                                 |  1 |
| Trainer                                                |  1 |
| HR executive                                           |  1 |
| Oparetar                                               |  1 |
| Welder (at present dismissed )                         |  1 |
| Winding                                                |  2 |
| Hk                                                     |  2 |
| Pre assembly                                           |  1 |
| Quality inspection                                     |  1 |
| MECHANICAL FITTER                                      |  1 |
| Process                                                |  1 |
| As a Trainer                                           |  1 |
| Training                                               |  1 |
| Production                                             |  3 |
| Control panel assembly and wiring                      |  1 |
| ಆಪರೇಟರ್                                                |  1 |
| Dismissed                                              |  1 |
| D e d maintance                                        |  1 |
| Maintenance fitter                                     |  1 |
| CAD CAM                                                |  1 |
| Workmen                                                |  1 |
| Teacher                                                |  1 |
| Die maintenance                                        |  1 |
| Fitting                                                |  1 |
| Team leader                                            |  1 |
| Assembly section                                       |  1 |
| Maltiskild (Fitter/Welder).                            |  1 |
| Helper                                                 |  1 |
| Rider Bottel inspection                                |  1 |
| Kausual helper                                         |  1 |
| Quality check                                          |  1 |
| Employee                                               |  1 |
| Lab technician                                         |  1 |

+ How long have you been working in this factory?

#+NAME: work.duration
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[,.N,How.long.have.you.been.working.in.this.factory]
#+end_src

#+RESULTS: work.duration
| How.long.have.you.been.working.in.this.factory |  N |
|------------------------------------------------+----|
| More than 20 years                             | 38 |
| Less than 1 year                               |  9 |
| 5 - 10 years                                   | 28 |
| 3 - 5 years                                    |  7 |
| 10 - 20 years                                  | 67 |
| 1 - 3 years                                    |  1 |

+ Type of employment contract

#+NAME: What.type.of.employment.do.you.have
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[,.N,What.type.of.employment.do.you.have]
#+end_src

#+CAPTION: Type of employment contract
#+RESULTS: What.type.of.employment.do.you.have
| What.type.of.employment.do.you.have |   N |
|-------------------------------------+-----|
| Permanent                           | 121 |
| Apprentice                          |   3 |
| FTE                                 |   5 |
| Trainee                             |   2 |
| Contractual                         |   5 |
| Casual                              |  13 |
|                                     |   1 |


+ How many hours do you work per day?

#+NAME: How.many.hours.do.you.work.per.day
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[How.many.hours.do.you.work.per.day>24,How.many.hours.do.you.work.per.day:=NA]

  citu.cer[,.N,
           .(hours.of.work.per.day=round(How.many.hours.do.you.work.per.day))]
#+end_src

#+CAPTION: How many hours do you work per day
#+RESULTS: How.many.hours.do.you.work.per.day
| hours.of.work.per.day |   N |
|-----------------------+-----|
|                     8 | 111 |
|                       |  23 |
|                     9 |  14 |
|                     7 |   1 |
|                    12 |   1 |

+ Monthly wage

  #+NAME: How.many.hours.do.you.work.per.day
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[,Wage.Class:=NULL]
  citu.cer[What.is.your.monthly.wage.stipend.Rs.<100,
           What.is.your.monthly.wage.stipend.Rs.:=NA]
  citu.cer[What.is.your.monthly.wage.stipend.Rs.<10000,
           Wage.Class:="1. Less than 10,000"]
  citu.cer[What.is.your.monthly.wage.stipend.Rs.<20000&is.na(Wage.Class),
           Wage.Class:="2. Less than 20,000"]
  citu.cer[What.is.your.monthly.wage.stipend.Rs.<30000&is.na(Wage.Class),
           Wage.Class:="3. Less than 30,000"]
  citu.cer[What.is.your.monthly.wage.stipend.Rs.<40000&is.na(Wage.Class),
           Wage.Class:="4. Less than 40,000"]
  citu.cer[What.is.your.monthly.wage.stipend.Rs.<50000&is.na(Wage.Class),
           Wage.Class:="5. Less than 50,000"]
  citu.cer[What.is.your.monthly.wage.stipend.Rs.<60000&is.na(Wage.Class),
           Wage.Class:="6. Less than 60,000"]
  citu.cer[What.is.your.monthly.wage.stipend.Rs.<70000&is.na(Wage.Class),
           Wage.Class:="7. Less than 70,000"]
  citu.cer[What.is.your.monthly.wage.stipend.Rs.>=70000&is.na(Wage.Class),
           Wage.Class:="8. More than 70,000"]

  citu.cer[,.N,
           .(Wage.Class)][order(Wage.Class)]
#+end_src

#+CAPTION: Number of workers in different categories of monthly wages
#+RESULTS:
| Wage.Class          |  N |
|---------------------+----|
| 1. Less than 10,000 |  4 |
| 2. Less than 20,000 | 15 |
| 3. Less than 30,000 | 12 |
| 4. Less than 40,000 | 22 |
| 5. Less than 50,000 | 27 |
| 6. Less than 60,000 | 19 |
| 7. Less than 70,000 | 10 |
| 8. More than 70,000 | 11 |
|                     | 30 |

+ Overtime wages

#+NAME: If.overtime.wages.are.paid.at.double.rate.or.not
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[,.N,
           .(If.overtime.wages.are.paid.at.double.rate.or.not)]
#+end_src

#+CAPTION: Overtime wages
#+RESULTS:
| If.overtime.wages.are.paid.at.double.rate.or.not |  N |
|--------------------------------------------------+----|
| Yes                                              | 99 |
| No                                               | 26 |
|                                                  | 25 |

+ Overtime hours

#+NAME: Average.overtime.hours.per.week.
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[Average.overtime.hours.per.week.>50,Average.overtime.hours.per.week.:=NA]
  citu.cer[,.N,
           .(Average.overtime.hours.per.week.)][
    order(Average.overtime.hours.per.week.)]
#+end_src

#+CAPTION: Overtime hours
#+RESULTS: Average.overtime.hours.per.week.
| Average.overtime.hours.per.week. |  N |
|----------------------------------+----|
|                                0 | 46 |
|                                1 |  3 |
|                                2 | 10 |
|                                3 |  2 |
|                                4 | 17 |
|                                5 |  6 |
|                                6 |  4 |
|                                7 |  1 |
|                                8 | 20 |
|                               10 |  5 |
|                               16 |  6 |
|                               24 |  1 |
|                               48 |  2 |
|                                  | 27 |

+ PLI

#+NAME: If.there.is.any.Production.Linked.Incentives.PLI.
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[,.N,
           .(If.there.is.any.Production.Linked.Incentives.PLI.)][
    order(If.there.is.any.Production.Linked.Incentives.PLI.)]
#+end_src

#+CAPTION: PLI
#+RESULTS: If.there.is.any.Production.Linked.Incentives.PLI.
| If.there.is.any.Production.Linked.Incentives.PLI. |  N |
|---------------------------------------------------+----|
| No                                                | 66 |
| Yes                                               | 59 |
|                                                   | 25 |

#+NAME: If.yes.how.much.do.you.earn.as.incentive
#+BEGIN_SRC R :results value :exports none :hlines :colnames yes
  citu.cer[,.N,
           .(If.yes.how.much.do.you.earn.as.incentive)][
    order(If.yes.how.much.do.you.earn.as.incentive)]
#+end_src

#+RESULTS: If.yes.how.much.do.you.earn.as.incentive
|     If.yes.how.much.do.you.earn.as.incentive |  N |
|----------------------------------------------+----|
|                                            0 |  8 |
|                                         1000 |  1 |
|                                         1100 |  1 |
|                                         1200 |  1 |
|                                         1300 |  1 |
|                                      1400=00 |  1 |
|                                         1500 |  3 |
|                                        19000 |  1 |
|                                          200 |  1 |
|                                         2000 |  1 |
|                                        24000 |  1 |
|                                        24200 |  6 |
|                                         2750 |  1 |
|                                         3000 |  2 |
|                                        30000 |  1 |
|                                         3500 |  1 |
|                                        37000 |  1 |
|                                         3800 |  5 |
|                                        38000 |  1 |
|                                         4000 |  1 |
|                                        60000 |  1 |
|                                       7 days |  1 |
|                                          900 |  1 |
|                                900 Per.month |  1 |
| Less than 10% , depends on achiveing targets |  1 |
|                      Manthly KPI 1800to 2000 |  1 |
|                                         Nill |  1 |
|                                           No | 13 |
|                                      Nothing |  1 |
|                                           Ok |  1 |
|                                          YES |  1 |
|                                 Yearly 20000 |  1 |
|                                          Yes |  3 |
|                                      पर part |  1 |
|                                              | 83 |

+ Safety measures

#+NAME: Safety.measures.at.workplace.Are.safety.measures.followed
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[,.N,
           .(Safety.measures.at.workplace.Are.safety.measures.followed)][
    order(Safety.measures.at.workplace.Are.safety.measures.followed)]
#+end_src

#+CAPTION: Safety measures
#+RESULTS:
| Safety.measures.at.workplace.Are.safety.measures.followed |   N |
|-----------------------------------------------------------+-----|
| No                                                        |   4 |
| Yes                                                       | 118 |
|                                                           |  28 |

#+NAME: fatal.accident.if.any
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,
             .(Safety.measures.at.workplace.Was.there.any.fatal.accident.in.the.last.1.year)]
#+end_src

#+CAPTION: Fatal accidents
#+RESULTS: fatal.accident.if.any
| Safety.measures.at.workplace.Was.there.any.fatal.accident.in.the.last.1.year |   N |
|------------------------------------------------------------------------------+-----|
| No                                                                           | 111 |
| Yes                                                                          |  11 |
|                                                                              |  28 |


+ Leaves

#+NAME: Do.you.get.a.paid.weekly.off
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,
             .(Do.you.get.a.paid.weekly.off)]
  #+end_src

#+CAPTION: Paid weekly off
#+RESULTS: Do.you.get.a.paid.weekly.off
  | Do.you.get.a.paid.weekly.off |  N |
  |------------------------------+----|
  | Yes                          | 99 |
  | No                           | 23 |
  |                              | 28 |

#+NAME: No.of.days.of.paid.leave.per.year.Casual.Leave
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,
             .(No.of.days.of.paid.leave.per.year.Casual.Leave)][order(No.of.days.of.paid.leave.per.year.Casual.Leave)]
  #+end_src

#+CAPTION: Paid casual leaves per year
#+RESULTS: No.of.days.of.paid.leave.per.year.Casual.Leave
  | No.of.days.of.paid.leave.per.year.Casual.Leave |  N |
  |------------------------------------------------+----|
  |                                              0 | 13 |
  |                                              2 |  2 |
  |                                              4 |  5 |
  |                                              5 |  3 |
  |                                              6 |  8 |
  |                                              7 | 17 |
  |                                              8 | 24 |
  |                                              9 | 11 |
  |                                             10 |  2 |
  |                                             11 |  1 |
  |                                             12 | 13 |
  |                                             14 |  3 |
  |                                             15 |  5 |
  |                                             16 |  6 |
  |                                             18 |  1 |
  |                                             20 |  1 |
  |                                             24 |  2 |
  |                                             30 |  2 |
  |                                                | 31 |

#+NAME: No.of.days.of.paid.leave.per.year.Earned.Leave
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,
             .(No.of.days.of.paid.leave.per.year.Earned.Leave)][order(No.of.days.of.paid.leave.per.year.Earned.Leave)]
  #+end_src

#+CAPTION: Earned leaves
#+RESULTS: No.of.days.of.paid.leave.per.year.Earned.Leave
  | No.of.days.of.paid.leave.per.year.Earned.Leave |  N |
  |------------------------------------------------+----|
  |                                              0 | 18 |
  |                                              2 |  2 |
  |                                              6 |  1 |
  |                                              7 |  1 |
  |                                              8 |  1 |
  |                                             10 |  2 |
  |                                             11 |  3 |
  |                                             12 | 13 |
  |                                             13 |  5 |
  |                                             14 | 24 |
  |                                             15 | 24 |
  |                                             16 |  9 |
  |                                             17 |  2 |
  |                                             18 |  1 |
  |                                             20 |  1 |
  |                                             21 |  7 |
  |                                             24 |  2 |
  |                                             26 |  1 |
  |                                             30 |  1 |
  |                                             32 |  1 |
  |                                                | 31 |

#+NAME: No.of.days.of.paid.leave.per.year.Medical.Leave
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,
             .(No.of.days.of.paid.leave.per.year.Medical.Leave)][order(No.of.days.of.paid.leave.per.year.Medical.Leave)]
  #+end_src

  #+CAPTION: Medical leaves
  #+RESULTS: No.of.days.of.paid.leave.per.year.Medical.Leave
  | No.of.days.of.paid.leave.per.year.Medical.Leave |  N |
  |-------------------------------------------------+----|
  |                                               0 | 23 |
  |                                               2 |  3 |
  |                                               5 |  1 |
  |                                               6 | 11 |
  |                                               7 | 24 |
  |                                               8 |  3 |
  |                                               9 | 17 |
  |                                              10 | 12 |
  |                                              11 |  4 |
  |                                              12 | 13 |
  |                                              13 |  3 |
  |                                              14 |  1 |
  |                                              15 |  3 |
  |                                              17 |  1 |
  |                                                 | 31 |

+ Bonus



#+NAME: Whether.you.get.Bonus
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Whether.you.get.Bonus)][order(Whether.you.get.Bonus)]
  #+end_src

  #+RESULTS: Whether.you.get.Bonus
  | Whether.you.get.Bonus |   N |
  |-----------------------+-----|
  | No                    |  11 |
  | Yes                   | 108 |
  |                       |  31 |

#+NAME: If.yes.in.cash.or.kind.Cash.Amount.Value
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
  citu.cer[If.yes.in.cash.or.kind.Cash.Amount.Value=="2,oo,ooo",
           If.yes.in.cash.or.kind.Cash.Amount.Value:="200000"]
  citu.cer[,bonus.cash:=as.numeric(If.yes.in.cash.or.kind.Cash.Amount.Value)]
  citu.cer[bonus.cash<1,bonus.cash:=NA]
  citu.cer[bonus.cash<=75000,bonus.category:="4. More than 75000"]
  citu.cer[bonus.cash<75000,bonus.category:="3. Less than 75000"]
  citu.cer[bonus.cash<50000,bonus.category:="2. Less than 50000"]
  citu.cer[bonus.cash<25000,bonus.category:="1. Less than 25000"]
  citu.cer[,.N,.(bonus.category)][
    order(bonus.category)]
  #+end_src

#+CAPTION: Value of cash bonus
  #+RESULTS: If.yes.in.cash.or.kind.Cash.Amount.Value
  | bonus.category     |  N |
  |--------------------+----|
  | 1. Less than 25000 | 21 |
  | 2. Less than 50000 | 21 |
  | 3. Less than 75000 |  9 |
  | 4. More than 75000 |  1 |
  |                    | 98 |

+ Other benefits



  #+NAME: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.PF
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(PF=Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.PF)]
  #+end_src

 #+CAPTION: PF
  #+RESULTS: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.PF
  | PF |   N |
  |----+-----|
  | PF | 103 |
  |    |  47 |

#+NAME: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.ESI
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(ESI=Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.ESI)]
  #+end_src

  #+CAPTION: ESI
  #+RESULTS: ESI Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.ESI
  | ESI |   N |
  |-----+-----|
  |     | 127 |
  | ESI |  23 |


#+NAME: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Mediclaim
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Mediclaim=Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Mediclaim)]
  #+end_src

  #+CAPTION: Mediclaim
  #+RESULTS: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Mediclaim
  | Mediclaim |  N |
  |-----------+----|
  | Mediclaim | 90 |
  |           | 60 |

#+NAME: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Pension
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Pension=Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Pension)]
  #+end_src

#+CAPTION: Pension
#+RESULTS: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Pension
| Pension |  N |
|---------+----|
| Pension | 59 |
|         | 91 |

#+NAME: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Gratuity
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Gratuity=Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Gratuity)]
  #+end_src

  #+CAPTION: Gratuity
  #+RESULTS: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Gratuity
  | Gratuity |  N |
  |----------+----|
  | Gratuity | 77 |
  |          | 73 |

#+NAME: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Maternity.Leave
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[Sex=="Female",.N,.(Maternity.leave=Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Maternity.Leave,Sex)]
  #+end_src

  #+CAPTION: Maternity leave for women workers
  #+RESULTS: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Maternity.leave
  | Maternity.leave | Sex    | N |
  |-----------------+--------+---|
  |                 | Female | 4 |
  | Maternity Leave | Female | 1 |

#+NAME: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Paternity.Leave
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[Sex=="Male",.N,.(Paternity.leave=Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Paternity.Leave,Sex)]
  #+end_src

  #+CAPTION: Paternity leave for male workers
  #+RESULTS: Whether.you.get.PF.ESI.Mediclaim.Pension.Gratuity.Maternity.leave.Paternity.leave.Paternity.Leave
  | Paternity.leave | Sex  |   N |
  |-----------------+------+-----|
  |                 | Male | 118 |
  | Paternity Leave | Male |  27 |

#+NAME: Whether.the.employers.are.paying.for.PF.or.ESI.PF
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Employer.Contribution.To.PF=Whether.the.employers.are.paying.for.PF.or.ESI.PF)]
  #+end_src

  #+CAPTION: Employers contributing to PF
  #+RESULTS: Whether.the.employers.are.paying.for.PF.or.ESI.PF
  | Employer.Contribution.To.PF |   N |
  |-----------------------------+-----|
  | Yes                         | 108 |
  | No                          |   7 |
  |                             |  35 |


#+NAME: Whether.the.employers.are.paying.for.PF.or.ESI.ESI
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Employer.Contribution.To.PF=Whether.the.employers.are.paying.for.PF.or.ESI.ESI)]
  #+end_src

  #+CAPTION: Employers contributing to ESI
  #+RESULTS: Whether.the.employers.are.paying.for.PF.or.ESI.ESI
  | Employer.Contribution.To.PF |  N |
  |-----------------------------+----|
  | No                          | 78 |
  | Yes                         | 37 |
  |                             | 35 |

+ Welfare facilities

#+NAME: Welfare.facilities.at.workplace.Drinking.water
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Drinking.water=Welfare.facilities.at.workplace.Drinking.water)]
  #+end_src

  #+CAPTION: Drinking water
  #+RESULTS: Welfare.facilities.at.workplace.Drinking.water
  | Drinking.water |   N |
  |----------------+-----|
  | Drinking water | 109 |
  |                |  41 |

#+NAME: Welfare.facilities.at.workplace.Toilet.for.men
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Toilet.for.men=Welfare.facilities.at.workplace.Toilet.for.men)]
  #+end_src

  #+caption: Toilet for men
  #+RESULTS: Welfare.facilities.at.workplace.Toilet.for.men
  | Toilet.for.men |   N |
  |----------------+-----|
  | Toilet for men | 107 |
  |                |  43 |

#+NAME: Welfare.facilities.at.workplace.Toilet.for.women
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Toilet.for.men=Welfare.facilities.at.workplace.Toilet.for.women)]
  #+end_src

  #+caption: Toilet for women
  #+RESULTS: Welfare.facilities.at.workplace.Toilet.for.women
  | Toilet.for.men   |  N |
  |------------------+----|
  |                  | 63 |
  | Toilet for women | 87 |



#+NAME: Welfare.facilities.at.workplace.Medical.facilities
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Medical.facilities=Welfare.facilities.at.workplace.Medical.facilities)]
  #+end_src

  #+caption: Medical facilities
  #+RESULTS: Welfare.facilities.at.workplace.Medical.facilities
  | Medical.facilities |   N |
  |--------------------+-----|
  | Medical facilities | 105 |
  |                    |  45 |

#+NAME: Welfare.facilities.at.workplace.Transport.facilities
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Transport.facilities=Welfare.facilities.at.workplace.Transport.facilities)]
  #+end_src

  #+caption: Transport facilities
  #+RESULTS: Welfare.facilities.at.workplace.Transport.facilities
  | Transport.facilities |  N |
  |----------------------+----|
  | Transport facilities | 89 |
  |                      | 61 |


  #+NAME: Welfare.facilities.at.workplace.Canteen
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Canteen.facilities=Welfare.facilities.at.workplace.Canteen)]
  #+end_src

  #+caption: Canteen
  #+RESULTS: Welfare.facilities.at.workplace.Canteen
  | Canteen.facilities |   N |
  |--------------------+-----|
  | Canteen            | 105 |
  |                    |  45 |

  #+NAME: Welfare.facilities.at.workplace.Crèche
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Crèche.facilities=Welfare.facilities.at.workplace.Crèche)]
  #+end_src

  #+caption: Crèche
  #+RESULTS: Welfare.facilities.at.workplace.Crèche
  | Crèche.facilities |   N |
  |-------------------+-----|
  |                   | 142 |
  | Crèche            |   8 |

  #+NAME: Welfare.facilities.at.workplace.Restroom
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Restroom.facilities=Welfare.facilities.at.workplace.Restroom)]
  #+end_src

#+caption: Restroom
  #+RESULTS: Welfare.facilities.at.workplace.Restroom
  | Restroom.facilities |   N |
  |---------------------+-----|
  | Restroom            |  42 |
  |                     | 108 |

#+NAME: Welfare.facilities.at.workplace.Parking.place
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Parking.facilities=Welfare.facilities.at.workplace.Parking.place)]
  #+end_src

  #+caption: Parking
  #+RESULTS: Welfare.facilities.at.workplace.Parking.place
  | Parking.facilities |  N |
  |--------------------+----|
  | Parking place      | 95 |
  |                    | 55 |

+ Additional employment

#+NAME: Are.you.also.engaged.in.any.other.job.besides.this.factory.job
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Additional.job=Are.you.also.engaged.in.any.other.job.besides.this.factory.job)]
  #+end_src

  #+caption: If engaged in any other job
  #+RESULTS: Are.you.also.engaged.in.any.other.job.besides.this.factory.job
  | Additional.job |  N |
  |----------------+----|
  | No             | 98 |
  | Yes            | 17 |
  |                | 35 |

+ Discrimination

#+NAME: Discrimination..Permanent.non.permanent
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Difference.Permanent.Temporary=Discrimination..Permanent.non.permanent)]
  #+end_src

#+caption: Differential treatment between permanent and non-permanent employees
  #+RESULTS: Discrimination..Permanent.non.permanent
  | Difference.Permanent.Temporary |   N |
  |--------------------------------+-----|
  |                                | 106 |
  | Permanent / non-permanent      |  44 |

#+NAME: Discrimination..Gender
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Difference.Gender=Discrimination..Gender)]
  #+end_src

  #+caption: Differential treatment by gender
  #+RESULTS: Discrimination..Gender
  | Difference.Gender |   N |
  |-------------------+-----|
  |                   | 132 |
  | Gender            |  18 |

  #+NAME: Discrimination..Caste
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Difference.Caste=Discrimination..Caste)]
  #+end_src

  #+caption: Differential treatment by caste
  #+RESULTS: Discrimination..Caste
  | Difference.Caste |   N |
  |------------------+-----|
  |                  | 135 |
  | Caste            |  15 |

  #+NAME: Discrimination..Religion
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Difference.Religion=Discrimination..Religion)]
  #+end_src

  #+caption: Differential treatment by religion
  #+RESULTS: Discrimination..Religion
  | Difference.Religion |   N |
  |---------------------+-----|
  |                     | 135 |
  | Religion            |  15 |

  #+NAME: Discrimination..Language
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Difference.Language=Discrimination..Language)]
  #+end_src

  #+caption: Differential treatment by language
  #+RESULTS: Discrimination..Language
  | Difference.Language |   N |
  |---------------------+-----|
  |                     | 133 |
  | Language            |  17 |

  #+NAME: Discrimination..Local.migrant
#+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Difference.Local.migrant=Discrimination..Local.migrant)]
  #+end_src

  #+caption: Differential treatment between local and migrant workers
  #+RESULTS: Discrimination..Local.migrant
  | Difference.Local.migrant |   N |
  |--------------------------+-----|
  |                          | 137 |
  | Local / migrant          |  13 |

+ Sexual harassment



  #+NAME: Sexual.harassment.at.workplace.Has.there.been.any.case.of.sexual.harassment
  #+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Sexual.harassment.at.workplace.Has.there.been.any.case.of.sexual.harassment)]
  #+end_src

  #+CAPTION: Cases of sexual harassment
  #+RESULTS: Sexual.harassment.at.workplace.Has.there.been.any.case.of.sexual.harassment
  | Sexual.harassment.at.workplace.Has.there.been.any.case.of.sexual.harassment |  N |
  |-----------------------------------------------------------------------------+----|
  | No                                                                          | 98 |
  |                                                                             | 49 |
  | Yes                                                                         |  3 |

#+NAME: Sexual.harassment.at.workplace.Is.there.an.Internal.Complaints.Committee.ICC.
  #+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(ICC=Sexual.harassment.at.workplace.Is.there.an.Internal.Complaints.Committee.ICC.)]
  #+end_src

  #+caption: If there is an ICC
  #+RESULTS: Sexual.harassment.at.workplace.Is.there.an.Internal.Complaints.Committee.ICC.
  | ICC |  N |
  |-----+----|
  | Yes | 44 |
  | No  | 53 |
  |     | 53 |

+ Union

  #+NAME: Whether.Union.is.there
  #+BEGIN_SRC R :results value :exports results :hlines :colnames yes
    citu.cer[,.N,.(Union=Whether.Union.is.there)]
  #+end_src

  #+caption: If there is a union
  #+RESULTS: Whether.Union.is.there
  | Union |   N |
  |-------+-----|
  | Yes   | 103 |
  | No    |   7 |
  |       |  40 |
